БухЭксп/Documents/CW_РаспределениеЗатратПутевыхЛистовПоГрузоперевозкам.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>CW_РаспределениеЗатратПутевыхЛистовПоГрузоперевозкам</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.CW_РасходыПоГрузоперевозкамТранспортныхСредств</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>БазаРаспределения</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНачала</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Расходы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>СчетЗатрат</Name>
							<Type>
								<v8:Type>cfg:ChartOfAccountsRef.Хозрасчетный</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПодразделениеОрганизации</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Субконто1</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ВидыСубконтоХозрасчетные</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Субконто2</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ВидыСубконтоХозрасчетные</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Субконто3</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ВидыСубконтоХозрасчетные</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДокументРасходов</Name>
							<Type>
								<v8:TypeSet>cfg:DocumentRef</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Валюта</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПутевойЛист</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.CW_ПутевойЛист</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Номенклатура1</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Номенклатура2</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Номенклатура3</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>РаспределениеЗатрат</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ПутевойЛист</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.CW_ПутевойЛист</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Грузоперевозка</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.CW_Грузоперевозки</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Заказ</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.CW_Заказы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДокументРасходов</Name>
							<Type>
								<v8:TypeSet>cfg:DocumentRef</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.CW_Номенклатура</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтатьяЗатрат</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.CW_СтатьяЗатрат</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Валюта</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.CW_Валюты</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Всего</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НДС</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Всего_Валюта</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

БухЭксп/InformationRegisters/CW_СоответствияПутевыхЛистовИНоменклатурныхГрупп.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>CW_СоответствияПутевыхЛистовИНоменклатурныхГрупп</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>НоменклатурнаяГруппа</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НоменклатурныеГруппы</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ПутевойЛист</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.CW_ПутевойЛист</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

БухЭксп/InformationRegisters/CW_СтатьиЗатратНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>CW_СтатьиЗатратНоменклатуры</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>СтатьяЗатрат</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.CW_СтатьяЗатрат</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

БухЭксп/Documents/CW_РаспределениеЗатратПутевыхЛистовПоГрузоперевозкам/Forms/ФормаДокумента/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	CW_Документы.УстановитьПараметрыФункциональныхОпцийФормы(Этаформа);
	
	ВестиУчетПоОрганизациям 			= ПолучитьФункциональнуюОпцию("ВестиУчетПоОрганизациям");
	Элементы.Организация.Видимость 		= ВестиУчетПоОрганизациям;
	
	СчетОсновноеПроизводство 			= ПланыСчетов.Хозрасчетный.ОсновноеПроизводство;
	
	ТипНоменклатурныеГруппы 			= Новый ОписаниеТипов("СправочникСсылка.НоменклатурныеГруппы");
	ТипСтатьиЗатрат 					= Новый ОписаниеТипов("СправочникСсылка.СтатьиЗатрат");
	
	ДанныеСчета = БухгалтерскийУчетВызовСервераПовтИсп.ПолучитьСвойстваСчета(СчетОсновноеПроизводство);
	
	Для Индекс = 1 По ДанныеСчета.КоличествоСубконто Цикл
		
		ТипЗначенияСубконто = ДанныеСчета["ВидСубконто" + Индекс + "ТипЗначения"];
		
		Если ТипЗначенияСубконто = ТипНоменклатурныеГруппы Тогда
			ИмяСубконтоНоменклатурнаяГруппа = "Субконто"+Индекс;	
		КонецЕсли;
		
		Если ТипЗначенияСубконто = ТипСтатьиЗатрат Тогда
			ИмяСубконтоСтатьяЗатрат = "Субконто"+Индекс;	
			ИмяПоляНоменклатура 	= "Номенклатура"+Индекс;
		КонецЕсли;
		
	КонецЦикла;
	
	Для Индекс = 1 По ДанныеСчета.КоличествоСубконто Цикл
		
		ИмяПоля = "Номенклатура"+Индекс;
		
		Элементы["Расходы"+ИмяПоля].Доступность = ИмяПоля = ИмяПоляНоменклатура;
			
	КонецЦикла;

	
	Если Параметры.Ключ.Пустая() Тогда
		
		ПодготовитьФормуНаСервере();
		
		Объект.ДатаНачала 		= НачалоМесяца(ТекущаяДата());
		Объект.ДатаОкончания 	= КонецМесяца(ТекущаяДата());
		Объект.Организация 		= CW_Настройки.ОсновнаяОрганизация();
	КонецЕсли;
	
	ТекущаяОрганизация = Объект.Организация;
	
	ДополнитьТаблицуНаСервере();
	
	ОбновитьПредставлениеПериодаНаФорме();
	
	УстановитьУсловноеОформление();	
	
	//Внешние подклчюаемые команды
	CW_ПодключаемыеКомандыСервер.ПриСозданииНаСервере(ЭтотОбъект);
	
КонецПроцедуры

&НаСервере
Процедура ДополнитьТаблицуНаСервере()
	
	Для Каждого СтрокаРасходы из Объект.Расходы Цикл
		СтрокаРасходы[ИмяПоляНоменклатура+"Доступность"] = Истина;
	КонецЦикла;

КонецПроцедуры

&НаСервере
Процедура ЗаполнитьРасходыНаСервере()
	
	Запрос = Новый Запрос;  
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ХозрасчетныйОбороты.Счет КАК СчетЗатрат,
	|	ХозрасчетныйОбороты.Подразделение КАК ПодразделениеОрганизации,";
	
	Для Индекс = 1 По ДанныеСчета.КоличествоСубконто Цикл
		
		Запрос.Текст = Запрос.Текст +"
		|	ХозрасчетныйОбороты.Субконто"+Индекс+" КАК Субконто"+Индекс+",";
		
	КонецЦикла;
	
	Запрос.Текст = Запрос.Текст +"
	|	ХозрасчетныйОбороты.Регистратор КАК ДокументРасходов,
	|	ХозрасчетныйОбороты.Валюта КАК Валюта,
	|	СУММА(ХозрасчетныйОбороты.СуммаОборотДт) КАК Сумма
	| 	ПОМЕСТИТЬ ВТ_ДанныеБУ
	|ИЗ
	|	РегистрБухгалтерии.Хозрасчетный.Обороты(&ДатаНачала, &ДатаОкончания, Регистратор, Счет = &Счет_20, , , , ) КАК ХозрасчетныйОбороты";
	
	Запрос.Текст = Запрос.Текст +"
	|
	|СГРУППИРОВАТЬ ПО
	|	ХозрасчетныйОбороты.Счет,
	|	ХозрасчетныйОбороты.Подразделение,";
	
	Для Индекс = 1 По ДанныеСчета.КоличествоСубконто Цикл
		Запрос.Текст = Запрос.Текст +"
		|	ХозрасчетныйОбороты.Субконто"+Индекс+",";
	КонецЦикла;
	
	Запрос.Текст = Запрос.Текст +"
	|	ХозрасчетныйОбороты.Регистратор,
	|	ХозрасчетныйОбороты.Валюта";
	
	
	Запрос.УстановитьПараметр("ДатаНачала"		, ПериодДанных.ДатаНачала);
	Запрос.УстановитьПараметр("ДатаОкончания"	, Новый Граница(ПериодДанных.ДатаОкончания, ВидГраницы.Включая));
	Запрос.УстановитьПараметр("Счет_20"			, СчетОсновноеПроизводство);

	Запрос.Выполнить();
	
	#Область Соответствия_Путевых_Листов_номенклатурным_группам
	//Заполняем соответствия
	Запрос.Текст = "ВЫБРАТЬ
	               |	CW_СоответствияПутевыхЛистовИНоменклатурныхГрупп.ПутевойЛист КАК ПутевойЛист,
	               |	CW_СоответствияПутевыхЛистовИНоменклатурныхГрупп.НоменклатурнаяГруппа КАК НоменклатурнаяГруппа
	               |ИЗ
	               |	РегистрСведений.CW_СоответствияПутевыхЛистовИНоменклатурныхГрупп КАК CW_СоответствияПутевыхЛистовИНоменклатурныхГрупп
	               |ГДЕ
	               |	CW_СоответствияПутевыхЛистовИНоменклатурныхГрупп.НоменклатурнаяГруппа В
	               |			(ВЫБРАТЬ
	               |				ВТ_ДанныеБУ."+ИмяСубконтоНоменклатурнаяГруппа+"
	               |			ИЗ
	               |				ВТ_ДанныеБУ КАК ВТ_ДанныеБУ)
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	CW_СоответствияПутевыхЛистовИНоменклатурныхГрупп.ПутевойЛист,
	               |	CW_СоответствияПутевыхЛистовИНоменклатурныхГрупп.НоменклатурнаяГруппа";
	
	
	РезультатЗапросаПутевыеЛисты = Запрос.Выполнить();
	
	СоответствияПутевыхЛистов = Новый Соответствие;
	ВыборкаДетали = РезультатЗапросаПутевыеЛисты.Выбрать();
	
	Пока ВыборкаДетали.Следующий() Цикл 
		Если ЗначениеЗаполнено(ВыборкаДетали.НоменклатурнаяГруппа) Тогда
			СоответствияПутевыхЛистов.Вставить(ВыборкаДетали.НоменклатурнаяГруппа, ВыборкаДетали.ПутевойЛист);
		КонецЕсли;
	КонецЦикла;
	
	#КонецОбласти
	
	#Область Соответствие_Статей_затрат_Номенклатуры
	//Заполняем соответствия
		Запрос.Текст = "ВЫБРАТЬ
		               |	CW_СтатьиЗатратНоменклатуры.СтатьяЗатрат КАК СтатьяЗатрат,
		               |	CW_СтатьиЗатратНоменклатуры.Номенклатура КАК Номенклатура
		               |ИЗ
		               |	РегистрСведений.CW_СтатьиЗатратНоменклатуры КАК CW_СтатьиЗатратНоменклатуры
		               |ГДЕ
		               |	CW_СтатьиЗатратНоменклатуры.СтатьяЗатрат В
		               |			(ВЫБРАТЬ
		               |				ВТ_ДанныеБУ."+ИмяСубконтоСтатьяЗатрат+"

		               |			ИЗ
		               |				ВТ_ДанныеБУ КАК ВТ_ДанныеБУ)";

	
	
	РезультатЗапросаСтатьиЗатрат = Запрос.Выполнить();
	
	СоответствияСтатьиЗатрат = Новый Соответствие;
	ВыборкаДетали = РезультатЗапросаСтатьиЗатрат.Выбрать();
	
	Пока ВыборкаДетали.Следующий() Цикл 
		СоответствияСтатьиЗатрат.Вставить(ВыборкаДетали.СтатьяЗатрат, ВыборкаДетали.Номенклатура);
	КонецЦикла;
	
	#КонецОбласти
	
	Запрос.Текст =  "ВЫБРАТЬ *
					| ИЗ ВТ_ДанныеБУ КАК ВТ_ДанныеБУ";
	
	РезультатЗапроса =	Запрос.Выполнить();


	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		Если ЗначениеЗаполнено(ИмяСубконтоНоменклатурнаяГруппа) Тогда
			
			ПутевойЛист = СоответствияПутевыхЛистов.Получить(Выборка[ИмяСубконтоНоменклатурнаяГруппа]);
			
			Если ПутевойЛист <> Неопределено Тогда
				
				СтрокаРасходы = Объект.Расходы.Добавить();
				
				ЗаполнитьЗначенияСвойств(СтрокаРасходы, Выборка);
				
				СтрокаРасходы.ПутевойЛист 							= ПутевойЛист;
				СтрокаРасходы[ИмяПоляНоменклатура] 					= СоответствияСтатьиЗатрат.Получить(Выборка[ИмяСубконтоСтатьяЗатрат]);
				СтрокаРасходы[ИмяПоляНоменклатура+"Доступность"] 	= Истина;
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
	
	ПодготовитьФормуНаСервере();
	УстановитьУсловноеОформление();	
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаЗаполнить(Команда)
	
	Если Объект.Расходы.Количество() > 0 Тогда
		
		Режим = РежимДиалогаВопрос.ДаНет;
		Оповещение = Новый ОписаниеОповещения("ПослеЗакрытияВопроса", ЭтаФорма, Параметры);
		ПоказатьВопрос(Оповещение, "Табличная часть будет перезаполнена. Продоложить?", Режим, 0);
		
	Иначе
		
		ЗаполнитьРасходыНаСервере();
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗакрытияВопроса(Результат, Параметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Нет Тогда
        Возврат;
	КонецЕсли;
	
	Объект.Расходы.Очистить();

	ЗаполнитьРасходыНаСервере();

КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	ТекущийОбъект.ДатаНачала 		= ПериодДанных.ДатаНачала;
	ТекущийОбъект.ДатаОкончания  	= ПериодДанных.ДатаОкончания;
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьпредставлениеПериодаНаФорме()
	
	ПериодДанных.ДатаНачала 	= Объект.ДатаНачала;
	ПериодДанных.ДатаОкончания 	= Объект.ДатаОкончания;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьУсловноеОформление()

	УсловноеОформление.Элементы.Очистить();

	Для Сч = 1 По 3 Цикл

		// Доступность субконто
		ЭлементУО = УсловноеОформление.Элементы.Добавить();

		КомпоновкаДанныхКлиентСервер.ДобавитьОформляемоеПоле(ЭлементУО.Поля, "РасходыСубконто" + Сч);

		ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ЭлементУО.Отбор,
			"Объект.Расходы.Субконто" + Сч + "Доступность", ВидСравненияКомпоновкиДанных.Равно, Ложь);

		ЭлементУО.Оформление.УстановитьЗначениеПараметра("Видимость", Ложь);
		
		КомпоновкаДанныхКлиентСервер.ДобавитьОформляемоеПоле(ЭлементУО.Поля, "РасходыНоменклатура" + Сч);

		ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ЭлементУО.Отбор,
			"Объект.Расходы.Номенклатура" + Сч + "Доступность", ВидСравненияКомпоновкиДанных.Равно, Ложь);

		ЭлементУО.Оформление.УстановитьЗначениеПараметра("Видимость", Ложь);
	
		
		// Обозначение пустых субконто
		ЭлементУО = УсловноеОформление.Элементы.Добавить();

		КомпоновкаДанныхКлиентСервер.ДобавитьОформляемоеПоле(ЭлементУО.Поля, "РасходыСубконто" + Сч);

		ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ЭлементУО.Отбор,
			"Объект.Расходы.Субконто" + Сч + "Доступность", ВидСравненияКомпоновкиДанных.Равно, Истина);

		ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ЭлементУО.Отбор,
			"Объект.Расходы.Субконто" + Сч, ВидСравненияКомпоновкиДанных.НеЗаполнено);
		
		ЭлементУО.Оформление.УстановитьЗначениеПараметра("ЦветТекста", ЦветаСтиля.НеЗаполненноеСубконто);

		ЭлементУО.Оформление.УстановитьЗначениеПараметра("Текст", НСтр("ru = '<...>'"));
		
		// Обозначение пустых номенклатур
		ЭлементУО = УсловноеОформление.Элементы.Добавить();

		КомпоновкаДанныхКлиентСервер.ДобавитьОформляемоеПоле(ЭлементУО.Поля, "РасходыНоменклатура" + Сч);

		ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ЭлементУО.Отбор,
			"Объект.Расходы.Номенклатура" + Сч + "Доступность", ВидСравненияКомпоновкиДанных.Равно, Истина);

		ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ЭлементУО.Отбор,
			"Объект.Расходы.Номенклатура" + Сч, ВидСравненияКомпоновкиДанных.НеЗаполнено);
		
		ЭлементУО.Оформление.УстановитьЗначениеПараметра("ЦветФона"		, ЦветаСтиля.КритичноеСобытиеНадежностьБанковЦветФона);
		ЭлементУО.Оформление.УстановитьЗначениеПараметра("ЦветТекста"	, ЦветаСтиля.НеЗаполненноеСубконто);

		ЭлементУО.Оформление.УстановитьЗначениеПараметра("Текст", НСтр("ru = '<Выберите номенклатуру>'"));

	КонецЦикла;


	// Субконто
	// Первое субконто не скрываем, чтобы не мигала колонка в разных строках.
	ЭлементУО = УсловноеОформление.Элементы.Добавить();
	КомпоновкаДанныхКлиентСервер.ДобавитьОформляемоеПоле(ЭлементУО.Поля, "РасходыСубконто1");
	КомпоновкаДанныхКлиентСервер.ДобавитьОформляемоеПоле(ЭлементУО.Поля, "РасходыНоменклатура1");
	
	ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ЭлементУО.Отбор,
		"Объект.Расходы.Субконто1Доступность", ВидСравненияКомпоновкиДанных.Равно, Ложь);
	ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ЭлементУО.Отбор,
		"Объект.Расходы.Субконто2Доступность", ВидСравненияКомпоновкиДанных.Равно, Ложь);
	ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ЭлементУО.Отбор,
		"Объект.Расходы.Субконто3Доступность", ВидСравненияКомпоновкиДанных.Равно, Ложь);
	
	ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ЭлементУО.Отбор,
		"Объект.Расходы.Номенклатура1Доступность", ВидСравненияКомпоновкиДанных.Равно, Ложь);
	ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ЭлементУО.Отбор,
		"Объект.Расходы.Номенклатура2Доступность", ВидСравненияКомпоновкиДанных.Равно, Ложь);
	ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ЭлементУО.Отбор,
		"Объект.Расходы.Номенклатура3Доступность", ВидСравненияКомпоновкиДанных.Равно, Ложь);
	
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("Видимость", Истина);
	
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("ТолькоПросмотр", Истина);


	// РасходыПодразделениеОрганизации
	
	ЭлементУО = УсловноеОформление.Элементы.Добавить();

	КомпоновкаДанныхКлиентСервер.ДобавитьОформляемоеПоле(ЭлементУО.Поля, "РасходыПодразделениеОрганизации");

	ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ЭлементУО.Отбор,
		"Объект.Расходы.ПодразделениеОрганизацииДоступность", ВидСравненияКомпоновкиДанных.Равно, Ложь);

	ЭлементУО.Оформление.УстановитьЗначениеПараметра("Видимость", Ложь);


	// РасходыВалюта
	ЭлементУО = УсловноеОформление.Элементы.Добавить();
	КомпоновкаДанныхКлиентСервер.ДобавитьОформляемоеПоле(ЭлементУО.Поля, "РасходыВалюта");
	
	ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ЭлементУО.Отбор,
		"Объект.Расходы.Валютный", ВидСравненияКомпоновкиДанных.Равно, ложь);
	
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("Видимость", Ложь);
	
КонецПроцедуры

&НаСервере
Процедура ПодготовитьФормуНаСервере()
	
	БухгалтерскийУчетКлиентСервер.УстановитьНачальныеСвойстваСубконтоТаблицы(
		Объект.Расходы,
		ПараметрыУстановкиСвойствСубконто(ЭтотОбъект));
		
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция ПараметрыУстановкиСвойствСубконто(Форма)

	Результат = БухгалтерскийУчетКлиентСервер.ПараметрыУстановкиСвойствСубконтоПоШаблону(
		"РасходыСубконто" , "РасходыПодразделениеОрганизации", "Субконто", "ПодразделениеОрганизации", "СчетЗатрат");
	Результат.ДопРеквизиты.Вставить("Организация"	, Форма.Объект.Организация);
	Результат.ПоляОбъекта.Вставить("Валютный"		, "Валютный");
	
	Возврат Результат;

КонецФункции

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	ПодготовитьФормуНаСервере();

КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	БухгалтерскийУчетКлиентСервер.УстановитьНачальныеСвойстваСубконтоТаблицы(
		Объект.Расходы,
		ПараметрыУстановкиСвойствСубконто(ЭтотОбъект));
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)

	ПараметрыОтбора = Новый Структура;
	ПараметрыОтбора.Вставить(ИмяПоляНоменклатура+"Доступность", Истина);
	ПараметрыОтбора.Вставить(ИмяПоляНоменклатура, ПредопределенноеЗначение("Справочник.Номенклатура.ПустаяСсылка"));
	
	мСтроки = Объект.Расходы.НайтиСтроки(ПараметрыОтбора);
	
	Для Каждого СтрокаМассива из мСтроки Цикл
		
		Сообщение = новый СообщениеПользователю;
		Сообщение.Текст 		= "Необходимо выбрать номенклатуру в строке: "+Формат(СтрокаМассива.НомерСтроки,"ЧГ=0");
		Сообщение.Поле 			= "Расходы["+Формат(СтрокаМассива.НомерСтроки-1,"ЧГ=0")+"]."+ИмяПоляНоменклатура;
		Сообщение.ПутьКДанным	= "Объект";
		Сообщение.Сообщить();
		Отказ = истина;
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "ВыполнитьМетодВладельца" Тогда
			
		Если ТипЗнч(Параметр) = тип("Структура") Тогда
			УникальныйИдентификаторВладельца 	= Неопределено;
			МетодыФормыВладельца 				= Неопределено;
			
			Параметр.Свойство("УникальныйИдентификатор"	, УникальныйИдентификаторВладельца);
			Параметр.Свойство("МетодыФормыВладельца"	, МетодыФормыВладельца);
			
			Если ЭтаФорма.УникальныйИдентификатор = УникальныйИдентификаторВладельца Тогда
				Если Не МетодыФормыВладельца = Неопределено и ТипЗнч(МетодыФормыВладельца) = Тип("Массив") Тогда
					
					Для Каждого СтрокаМассива из МетодыФормыВладельца Цикл
						Попытка
							Выполнить(СтрокаМассива);
						Исключение
						КонецПопытки;
					КонецЦикла;
					
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;	

	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ОрганизацияПриИзмененииНаСервере()
	
	Если Не ТекущаяОрганизация = Объект.Организация Тогда
		Объект.Номер = "";
	КонецЕсли;
	
	ТекущаяОрганизация = Объект.Организация;
	
КонецПроцедуры

&НаКлиенте
Процедура ОрганизацияПриИзменении(Элемент)
	ОрганизацияПриИзмененииНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура КомандаРаспределить(Команда)
	
	РезультатВыполнения =  ПродолжитьРаспределениеЗатратНаСервереВФоне();
	
	ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
	ПараметрыОжидания.ВыводитьОкноОжидания = Истина;
	ОповещениеОЗавершении = Новый ОписаниеОповещения("ОбработатьРезультатРаспределенияЗатрат", ЭтотОбъект);
	
	ДлительныеОперацииКлиент.ОжидатьЗавершение(РезультатВыполнения, ОповещениеОЗавершении, ПараметрыОжидания);
	
КонецПроцедуры

&НаСервере
Функция ПродолжитьРаспределениеЗатратНаСервереВФоне()
	
	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияВФоне(Новый УникальныйИдентификатор);
	ПараметрыВыполнения.ОжидатьЗавершение 			= 0; // запускать сразу
	ПараметрыВыполнения.НаименованиеФоновогоЗадания = "Распределение затрат по грузоперевозкам";
	ПараметрыВыполнения.ЗапуститьВФоне 				= Истина;
	ПараметрыВыполнения.ЗапуститьНеВФоне 			= ложь;
	
	ПараметрыПроцедуры = Новый Структура;
	ПараметрыПроцедуры.Вставить("Дата", 				Объект.Дата);
	ПараметрыПроцедуры.Вставить("Ссылка", 				Объект.Ссылка);
	ПараметрыПроцедуры.Вставить("БазаРаспределения", 	Объект.БазаРаспределения);
	
	Возврат ДлительныеОперации.ВыполнитьВФоне("Документы.CW_РаспределениеЗатратПутевыхЛистовПоГрузоперевозкам.РаспределитьЗатратыПоГрузоперевозкам",ПараметрыПроцедуры, ПараметрыВыполнения);
	
КонецФункции

&НаКлиенте
Процедура ОбработатьРезультатРаспределенияЗатрат(РезультатВыполнения, Дополнительныепараметры) Экспорт
	
	Если РезультатВыполнения.Статус = "Выполнено" Тогда
		
		ЗаполнитьТабличнуюЧастьнаСервере(РезультатВыполнения.АдресРезультата);      
		
	ИначеЕсли РезультатВыполнения.Статус = "Ошибка" Тогда
		
		ТекстПредупреждения = "Ошибка распределения затрат!
		| По причине: "+ РезультатВыполнения.КраткоеПредставлениеОшибки + "
		| Информаиция об ошибке см. в журнале регистрации!";
		
		Если ТипЗнч(РезультатВыполнения.Сообщения) = Тип("Массив") Тогда
			Для Каждого СообщениеВМассиве из РезультатВыполнения.Сообщения Цикл
				СообщениеВМассиве.Сообщить();
			КонецЦикла;
		КонецЕсли;
		
		ПоказатьПредупреждение(,ТекстПредупреждения,,"Ошибка распределения затрат");
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьТабличнуюЧастьнаСервере(АдресРезультата)
	
	ТаблицаДанных = ПолучитьИзВременногоХранилища(АдресРезультата); 
	Если ТипЗнч(ТаблицаДанных) = Тип("ТаблицаЗначений") Тогда
		Объект.РаспределениеЗатрат.Загрузить(ТаблицаДанных);	
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОчиститьЗатраты(Результат, Параметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Нет Тогда
        Возврат;
    КонецЕсли;
	
	Объект.Расходы.Очистить();
КонецПроцедуры

&НаКлиенте
Процедура КомандаОчиститьЗатраты(Команда)
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ОчиститьЗатраты", ЭтотОбъект);
	
	Если Объект.РаспределениеЗатрат.Количество() > 0 Тогда
		
		Режим = РежимДиалогаВопрос.ДаНет;
		ПоказатьВопрос(ОписаниеОповещения, "Табличная часть будет очищена. Продолжить?", Режим, 0);
		
	Иначе
		ВыполнитьОбработкуОповещения(ОписаниеОповещения,КодВозвратаДиалога.Да); 
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОчиститьРаспределение(Результат, Параметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Нет Тогда
        Возврат;
    КонецЕсли;
	
	Объект.РаспределениеЗатрат.Очистить();
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаОчиститьРаспределение(Команда)
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ОчиститьРаспределение", ЭтотОбъект);
	
	Если Объект.РаспределениеЗатрат.Количество() > 0 Тогда
		
		Режим = РежимДиалогаВопрос.ДаНет;
		ПоказатьВопрос(ОписаниеОповещения, "Табличная часть будет очищена. Продолжить?", Режим, 0);
		
	Иначе
		ВыполнитьОбработкуОповещения(ОписаниеОповещения,КодВозвратаДиалога.Да); 
	КонецЕсли;
	
КонецПроцедуры


#Область Подключаемые_внешние_команды

&НаКлиенте
Процедура ВнешняяКоманда_ВыполнитьКоманду(Команда)
	
	CW_ПодключаемыеКомандыКлиент.ВыполнитьВнешнююКоманду(ЭтотОбъект, Команда.Имя);
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	//Подсистема.РаботаСПодключаемымиОбъектами
	CW_ПодключаемыеКомандыКлиент.ПослеЗаписи(ЭтотОбъект, ПараметрыЗаписи);
	//Подсистема.РаботаСПодключаемымиОбъектами

КонецПроцедуры

#КонецОбласти
